Revit 2027 API
ContinuousRailType.HandClearance Property
 The horizontal distance between the inner boundary of the rail and the path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HandClearance { get; set; }
Public Property HandClearance As Double
	Get
	Set
public:
property double HandClearance {
	double get ();
	void set (double value);
}
member HandClearance : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for clearance must be no more than 30000 feet in absolute value.
See Also
Reference
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace